Retrieves number of performance adviser rules in the list.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public int GetNumberOfRules()
  Visual Basic
Public Function GetNumberOfRules As Integer
  Visual C++
public:
int GetNumberOfRules()
 Return Value
 Number of performance adviser rules in the list.
 See Also
  PerformanceAdviser Class
  Autodesk.Revit.DB Namespace